{
  "card-1": {
    "serviceMenu": [
      {
        "item": "オリジナルデザインのWebサイト制作"
      },
      {
        "item": "PC・スマホ・タブレットなど多様なデバイスのレスポンシブデザイン対応"
      },
      {
        "item": "SEOを意識したマークアップ"
      },
      {
        "item": "WAI-ARIAに準拠したアクセシビリティ対応"
      }
    ]
  },
  "card-2": {
    "serviceMenu": [
      {
        "item": "高品質で洗練されたコーディング"
      },
      {
        "item": "Figma / Adobe XD / Photoshop / Illustrator からのコーディング"
      },
      {
        "item": "BEM / FLOCSS などのCSS設計を活用し、拡張性の高いスタイル構築"
      },
      {
        "item": "ページ表示速度を最適化し、高速なパフォーマンスを実現"
      },
      {
        "item": "デザインカンプを忠実に再現"
      }
    ]
  },
  "card-3": {
    "serviceMenu": [
      {
        "item": "WordPressのオリジナルテーマの制作"
      },
      {
        "item": "既存サイトのWordPress化（動的管理機能の追加）"
      },
      {
        "item": "WordPressのWP REST APIを活用したヘッドレスCMS化の構築に対応"
      },
      {
        "item": "高速で柔軟性の高いWebサイトを実現"
      },
      {
        "item": "Advanced Custom Fields (ACF) を活用し、管理画面をカスタマイズ"
      },
      {
        "item": "Contact Form 7 を用いたお問い合わせフォームの実装（スパム対策・自動返信設定対応）"
      }
    ]
  },
  "card-4": {
    "serviceMenu": [
      {
        "item": "既存のWebサイトの課題解決"
      },
      {
        "item": "軽微な修正から大規模なリニューアルまで柔軟に対応"
      },
      {
        "item": "日々の運用・保守業務まで対応"
      },
      {
        "item": "デザインやコーディングのリファクタリング（保守性向上・軽量化）"
      },
      {
        "item": "表示速度改善（不要なスクリプト削減・画像最適化・CDN導入）"
      },
      {
        "item": "レスポンシブ未対応サイトの最適化"
      }
    ]
  },



  "card011": {
    "service011": "「ユーザーの心をつかみ、成果につながるWebサイトを」企業のコーポレートサイト、キャンペーンLP、ブログ、採用サイト、個人サイトなど、目的に応じた最適なデザインと機能を提供。クライアントのブランド価値を最大限に引き出し、顧客体験を向上させるWebサイトを構築します。完全オリジナルのデザインを採用し、SEO対策やレスポンシブデザインを考慮。多様なデバイスで快適に閲覧できる、成果につながるWebサイトを提供します。デザインの再現性だけでなく、アクセシビリティや機能性にも配慮し、一貫したコンセプトのもと、洗練されたWebサイトを実現します。"
  },
  "card11": {
    "service11": "「ユーザーの心をつかむ、成果につながるWebサイトを」クライアントのビジネスやブランドの価値を最大限に引き出すホームページを制作します。デザインカンプを忠実に再現するだけでなく、アクセシビリティ・SEO・レスポンシブ対応を考慮し、視覚的な美しさと機能性を兼ね備えたサイトを構築します。クライアントの目的に沿ったWebサイトを、一貫したコンセプトと洗練されたデザインで実現します。"
  },
  "card12": {
    "service12": "コーポレートサイトから広告などのキャンペーン用LP、ブログサイト、採用サイト、個人サイトのような小さな規模のものまで、目的に応じた最適なデザインと機能を実現。企業ブランドの価値向上や顧客体験の向上に寄与するサイトを構築いたします。お客様のご要望にお応えする完全オリジナルのWebサイトを制作します。SEOやレスポンシブデザインにも対応し、多様なデバイスでのユーザビリティを重視した成果を生むWebサイトをご提供します。"

  },
  "card200": {
    "service200": "HTML、CSS・SASS、JavaScript・TypeScriptを駆使した高品質なコーディングを提供します。デザインカンプからピクセルパーフェクトな実装を行い、WAI-ARIAなどアクセシビリティやSEOを意識しています。レスポンシブデザインで多様なデバイスでの最適な表示を実現します。また、アニメーションやユーザビリティの高い機能も実装します。BEMなどのCSS設計の考えをベースに、保守性の高いCSSの構築を心がけています。"
  },
  "card13": {
    "service13": "「デザインを忠実に再現し、品質にこだわるコーディングを提供」デザインカンプのピクセルパーフェクトな再現を徹底し、HTML・CSS（SASS）・JavaScript（TypeScript）を駆使して、読みやすく保守性の高いコードを実装します。デザインの意図を正確に汲み取り、クオリティの高いコーディングを提供します。"
  },
  "card2": {
    "service2": "HTML、CSS（SASS）、JavaScript (TypeScript)を駆使し、高品質で洗練されたコーディングを提供します。デザインカンプを忠実に再現し、ピクセル単位での正確な仕上げを徹底。WAI-ARIAに準拠したアクセシビリティ対策や、SEOに配慮した最適なマークアップをします。レスポンシブデザインにより、PC・スマートフォン・タブレットなど、多様なデバイスでもストレスのない快適な閲覧体験をお届けします。また、BEMをはじめとするCSS設計の手法をベースに、メンテナンス性・拡張性に優れたコードを意識したスタイル設計を行います。さらに、GSAPやSwiperといったライブラリを活用し、視覚的に魅力的なアニメーションやインタラクションの実装も可能です。ユーザビリティとデザインの一体感を重視し、魅力的で使いやすいWebサイトを構築します。"
  },
  "card0": {
    "service0": "HTML、CSS（SASS）、JavaScript・TypeScriptを駆使し、高品質で洗練されたコーディングを提供します。デザインカンプを忠実に再現し、からピクセルパーフェクトな実装を徹底し、WAI-ARIAに準拠したアクセシビリティ対策や、SEOに配慮した構造的なマークアップを施し、を意識した最適なマークアップを実現。レスポンシブデザインにより、多様なデバイスでも快適に閲覧できる設計をし、どんな環境でも最適な表示を保証します。さらに、GSAPやSwiperなどのライブラリを活用し、洗練されたアニメーションやインタラクションの実装も可能です。また、BEMなどのCSS設計の手法をベースに、保守性が高く拡張しやすいコード設計を心がけ、プロジェクトのスケーラビリティにも配慮。ユーザビリティとデザインの一体感を重視し、魅力的で使いやすいWebサイトを構築します。"
  },
  "card030": {
    "service030": "WordPressのオリジナルテーマの制作や、WordPressのWP REST APIを活用したヘッドレスCMS構成に対応し、高速で柔軟性のある高品質なWebサイトを開発します。WordPressのオリジナルテーマ制作を通じて、ブランドイメージに合わせた唯一無二のWebサイトを構築します。さらに、WP REST APIを活用した高度なカスタマイズやヘッドレスCMS構成に対応し、高速で柔軟性の高いWebサイトを実現。最新技術を駆使し、クライアントの要件に合わせた高品質なサイトを提供いたします。"
  },
  "card03": {
    "service03": "「更新しやすく、拡張性の高いWordPressサイトを構築」WordPressのカスタムテーマ開発やWP REST APIを活用したヘッドレスCMS構成に対応し、自由度の高いサイト制作が可能です。運用しやすい設計を心がけ、カスタムフィールドやカスタム投稿タイプを活用し、情報更新をスムーズに行える構成を提供します。WordPressの柔軟性を最大限に活かし、運用しやすく、パフォーマンスに優れたサイトを実現します。"
  },
  "card30": {
    "service30": "WordPressのオリジナルテーマの制作や、WordPressのWP REST APIを活用したヘッドレスCMS構成に対応し、高速で柔軟性のある高品質なWebサイトを開発します。WordPressのオリジナルテーマ制作を通じて、ブランドイメージに合わせた唯一無二のWebサイトを構築します。さらに、WP REST APIを活用した高度なカスタマイズやヘッドレスCMS構成に対応し、高速で柔軟性の高いWebサイトを実現。最新技術を駆使し、クライアントの要件に合わせた高品質なサイトを提供いたします。"
  },
  "card040": {
    "service040": "「Webサイトの課題を解決し、持続的な成長をサポート」既存のWebサイトの問題点を洗い出し、デザインや機能の最適化、パフォーマンス向上を図る改修を行います。軽微な修正から大規模なリニューアルまで対応し、サイトの利便性やユーザー体験を向上させます。また、日々の更新作業や保守業務にも対応し、安定性やセキュリティを重視した運用体制を構築。継続的な改善を通じて、Webサイトがビジネスの成長を支える資産となるようサポートします。"
  },
  "card004": {
    "service004": "「Webサイトの課題を解決し、持続的な成長をサポート」既存のWebサイトの問題点を洗い出し、デザインや機能の最適化、パフォーマンス向上を図る改修を行います。軽微な修正から大規模なリニューアルまで対応し、サイトの利便性やユーザー体験を向上させます。また、日々の更新作業や保守業務にも対応し、安定性やセキュリティを重視した運用体制を構築。継続的な改善を通じて、Webサイトがビジネスの成長を支える資産となるようサポートします。"
  },
  "card04": {
    "service04": "「Webサイトの課題を解決し、ビジネスの成長を支えるサポートを」既存のWebサイトの問題点を洗い出し、課題解決につながる改修を行います。また、日々の更新作業や保守業務にも対応し、長期的なサイト運用をサポートします。"
  },
  "card40": {
    "service40": "既存のWebサイトの課題解決や、軽微な修正から大規模なリニューアルまで柔軟に対応し、デザインや機能の改修からパフォーマンス向上をサポートします。また、日々の運用・保守業務まで対応可能です。Webサイトの成長を継続的に支えるパートナーとして、安定性やセキュリティを重視した運用体制を構築します。軽微な修正から大規模なリニューアルまで柔軟に対応し、ビジネスの成功をサポートします。"
  }
}
