{
  "worksTitle": "Works",
  "worksText": "私の実績をご紹介していきます。これまで制作したWebサイトの一覧です。当サイトも自ら制作していますので実績の一つとして御覧ください。",
  "error": {
    "title": "Works Page Not Found",
    "text": "申し訳ございません。Worksページのデータを読み込むことができませんでした。もう一度お試しください。",
    "noIcon": "No icons available"
  },
  "work-1": {
    "left_leadMenu": [
      {
        "header": "夏祭り",
        "body": "架空の地方都市、袖ノ浦。「もし自分の生まれた街に大きな花火大会のある夏祭りがあったら？」という発想をもとにこのサイトを制作しました。本サイトは、夏祭りの情報発信を通じた観光客の集客、花火大会有料観覧席の予約機能の提供、そして袖ノ浦市の豊富な観光コンテンツを魅力的に紹介することで観光収益の向上や周遊促進を目指します。"
      },
      {
        "header": "",
        "body": "トップページ + 下層3ページからなる袖ノ浦港夏祭り | 袖ノ浦市観光委員会【公式サイト】は、XDデザインカンプからのコーディング課題を元にして、ロゴ、画像、テキスト、配色、要素、一部セクション構成を再設計し、独自のアイディアを加えた作品です。"
      },
      {
        "header": "ファーストビュー",
        "body": "ファーストビューは5枚の画像をCSSアニメーションを使ってズームしながらふわっと画像が切り替わります。夏祭りへの期待感を演出しています。"
      },
      {
        "header": "カレンダー",
        "body": "modal、flatpickrを使用し、ヘッダーの観覧予約ボタンを押すとモーダルが現れ、カレンダーから予約日時を選択できます。"
      },
      {
        "header": "アクセシビリティ",
        "body": "お知らせページではタブの切り替えで表示内容が異なります。また、タブの切り替え、ハンバーガーメニューはアクセシビリティに配慮した設計をして、地域の高齢者や障害を持つ方でも使いやすいサイト作りを心掛けました。"
      },
      {
        "header": "モバイルフレンドリーなレスポンシブデザイン",
        "body": "スマ―トフォンサイズでは視差効果を表現したパララックスデザインにすることで操作性や利便性を向上させて、夏祭りへの誘客促進を目指します。"
      }
    ]
  },
  "work-2": {
    "left_leadMenu": [
      {
        "header": "AI制作会社",
        "body": "「これからの時代はAI」というテーマのもと、アニメ、イラスト、Webサイト、CMなど、多岐にわたるジャンルでAIクリエイティビティを発揮する架空のAI制作会社「GAURA_STUDIO」のコーポレートサイトを制作しました。本サイトは、クリエイティビティ溢れるデザインを軸に洗練されたブランディングを実現することで、業界内での差別化とクライアントへの信頼性向上の貢献、そして新規クリエイター獲得促進ができる内容を目指しました。"
      },
      {
        "header": "",
        "body": "架空のAI制作会社「GAURA_STUDIO」は、XDデザインカンプからのコーディング課題を元にロゴ、画像、テキスト、配色、要素、一部セクション構成を再設計し、独自のアイディアを加えた作品です。"
      },
      {
        "header": "デザイン",
        "body": "本サイトは、コピー「躍進を続ける業界最注目のクリエイター集団」にふさわしい先鋭的でお洒落なデザインを目指しました。配色には#ab0f50や#402717をメインカラーとグラデーションに採用し、洗練された印象を演出。視覚的なアクセントとなるフォント'Cinzel Decorative'を使用し、全体のデザインに一貫したスタイリッシュさを持たせています。ファーストビューではParticles.js を用いて背景に合わせた美しいアニメーションを実装。会社のクリエイティビティを際立たせ、新規クリエイターの応募を促進します。"
      },
      {
        "header": "Vite + Swiper + GSAP",
        "body": "開発環境としてViteを採用し、高速なパフォーマンスを実現しています。Worksセクション では、Swiperを用いたスライドショーを導入し、多種多彩な制作実績を視覚的に魅力を最大化にアピール。スクロールトリガーを活用し、トップに戻るスムーズなアニメーションをGSAPで実装しました。"
      },
      {
        "header": "お問い合わせフォーム",
        "body": "Googleフォームを埋め込むことで静的サイトでもお問い合わせ機能を実現しています。また、送信ボタンは、必須項目を入力しないと送信できない仕様にすることでユーザーエクスペリエンスを向上させています。"
      },
      {
        "header": "アクセシビリティ",
        "body": "ハンバーガーメニューとアコーディオンメニューはアクセシビリティを重視し、キーボード操作のみでも快適に利用可能な設計を心掛けました。全てのユーザーがストレスなく利用できる環境を提供しています。"
      },
      {
        "header": "",
        "body": ""
      }
    ]
  },
  "work-3": {
    "left_leadMenu": [
      {
        "header": "写真日記アプリ",
        "body": "架空の写真日記アプリ「ぴくちゃ」の公式運営サイト。このサイトでは、架空のユーザー投稿の紹介や、ニュース配信を通じて、アプリ利用者に新しい情報を提供します。ターゲット層を主に女性ユーザーと想定し、配色には#e4007fや#fff9b1などの明るい色を採用し、可愛らしい「JKゴシックM」フォントやコミカルな画像、背景などを使用して親しみやすく非常に独創性溢れるデザインに仕上げました。"
      },
      {
        "header": "WordPress オリジナルテーマ制作",
        "body": "架空の写真日記アプリ「ぴくちゃ」の公式運営サイトは、XDデザインカンプからのコーディング課題を元にロゴ、画像、テキスト、配色、要素、一部セクション構成の配置を改変して静的サイト作成後、WordPressのオリジナルテーマとして構築した作品です。トップページ＋下層ページ8ページ。"
      },
      {
        "header": "更新機能",
        "body": "トップページに表示される「みんなの声」、下層ページの「有料サービス表」は、WordPressのプラグインの「Advanced Custom Fields（ACF）」を活用して常に最新の情報が更新できるように設計しています。"
      },
      {
        "header": "お問い合わせフォーム",
        "body": "ユーザー体験を重視したお問い合わせフォームを、プラグインの「Contact Form 7」で構築しました。送信後のサンクスページの表示、スパム対策、自動返信メールの設定などの機能を備え、高いユーザビリティを実現しています。"
      },
      {
        "header": "みんなの投稿ページ & お知らせページ",
        "body": "みんなの投稿ページは、記事ごとに関連記事やおすすめ記事を表示する機能を実装。さらにプラグインの「AddToAny Share Buttons」を活用し、各記事をSNSで共有できる仕組みを提供しています。お知らせページは、カスタム投稿タイプを用いて管理。また、テーマユニットテストデータを用いて動的処理による表示崩れがないかの確認もしています。"
      },
      {
        "header": "プラグイン",
        "body": "パンくずリストは「Breadcrumb NavXT」を使用してナビゲーションを向上しています。「EWWW Image Optimizer」で画像最適化をしてブラウザの読み込み速度を改善しています。セキュリティ対策は「All In One WP Security」および「SiteGuard WP Plugin」で不正アクセスリスクを軽減しています。"
      }
    ]
  },
  "work-4": {
    "left_leadMenu": [
      {
        "header": "",
        "body": "My Portfolio Siteはデザインからコーディングまで完全オリジナルのポートフォリオサイトです。WordPressをヘッドレスCMS化とAstroフレームワークを使用して高速表示かつACFやjsonファイルにデータ登録することで効率的な更新作業も可能としています。"
      },
      {
        "header": "Astro + WordPress REST API",
        "body": "フロントエンドには、高速かつ効率的な静的サイト生成フレームワーク「Astro」で開発。バックエンドには、WordPressをREST API経由で活用し、ヘッドレスCMSとして構築。ヘッドレスCMS化により、バックエンドのWordPressが外部に直接公開されるなどのセキュリティリスクを低減しています。また、Google PageSpeed Insightsではモバイルで90以上、デスクトップで95以上を達成。高速表示を実現し、高いパフォーマンスも兼ねたサイトになっています。"
      },
      {
        "header": "ダイナミックなWeb体験",
        "body": "GSAP、Swiper、tsParticles、js-confettiなどの洗練されたライブラリと豊富なアイコン画像を使用し、ページ遷移や背景、ボタン操作など多様なアニメーションを実装して、ユーザーの印象に残るダイナミックなWeb体験を提供しています。"
      },
      {
        "header": "直感的なナビゲーション設計",
        "body": "Reactのライブラリのreact-burger-menuを使用し、シンプルかつモダンなハンバーガーメニューを実装。ユーザーの操作性を向上させました。"
      },
      {
        "header": "シームレスなフォーム送信機能",
        "body": "Reactのライブラリのreact-hook-form + バリデーションライブラリのZod + WordPressのプラグインContact Form 7のREST APIを活用して開発。高精度なバリデーション機能、使いやすく高機能なお問い合わせフォームを構築しています。"
      },
      {
        "header": "効率的なコンテンツ管理",
        "body": "WordPressのAdvanced Custom Fields（ACF）REST APIとAstroのjsonファイルを活用し、WorksページやBlogページなどの情報を動的に管理。効率的な更新作業を可能にして、開発後の運用性にも配慮した設計にしています。"
      }
    ]
  }
}
